&После("ОбработкаЗаполнения")
Процедура АТ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АТ_ЗаявкаНаРаботы") Тогда
		// Заполнение шапки
		Договор = ДанныеЗаполнения.Договор;
		Исполнитель = ДанныеЗаполнения.Исполнитель;
		Контрагент = ДанныеЗаполнения.Контрагент;
		ОбъектЗаявки = ДанныеЗаполнения.ОбъектЗаявки;
		ЗаявкаНаРаботы = ДанныеЗаполнения.Ссылка;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда
		// Заполнение шапки
		Договор = ДанныеЗаполнения.ДоговорПоУмолчанию;
		Контрагент = ДанныеЗаполнения.Ссылка;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АТ_Обращение") Тогда
		// Заполнение шапки
		Контрагент = ДанныеЗаполнения.Контрагент;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Договор = ПолучитьДоговорПоУмолчанию(ДанныеЗаполнения.Контрагент);
		
	////////Акторг + 
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АТ_УчетРабот") Тогда
		Контрагент  = ДанныеЗаполнения.Контрагент;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Договор = ДанныеЗаполнения.Договор;
		Если Не ДанныеЗаполнения.Работы.Количество() = 0 Тогда
			Строка = ЭтотОбъект.УчетРаботИЗаявок.Добавить();
			Строка.УчетРабот = ДанныеЗаполнения.Ссылка;
			Строка.Договор = ДанныеЗаполнения.Договор;
			Строка.Количество = ДанныеЗаполнения.Работы.Итог("КоличествоПринятоеЗаказчиком");
		КонецЕсли;
	/////////Акторг -
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Функция ПолучитьДоговорПоУмолчанию(КонтрагентИзДанных)
	ДогПоУмолчанию= СПравочники.ДоговорыКонтрагентов.ПустаяСсылка();
	СпрДоговоры = Справочники.ДоговорыКонтрагентов.Выбрать(,КонтрагентИзДанных);
	Пока СпрДоговоры.Следующий() Цикл
		Если СпрДоговоры.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		Если Не СпрДоговоры.ВидДоговора = Перечисления.ВидыДоговоров.СПокупателем Тогда
			Продолжить;
		КонецЕсли;	
		ДогПоУмолчанию = СпрДоговоры.Ссылка;
	КонецЦикла;	
	Возврат ДогПоУмолчанию;
КонецФункции
