
&Вместо("ПроверяемыеРеквизитыОбсуждения")
Функция Aktorg_ПроверяемыеРеквизитыОбсуждения()
	
	СтруктураРеквизитов = Новый Структура;
	
	ДокументКлюч = "АвансовыйОтчет";
	СтрокаРеквизитов =
	"ДокументОснование,
	|Комментарий,
	|Организация,
	|Сотрудник,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "АктВыполненныхРабот";
	СтрокаРеквизитов =
	"Договор,
	|ДокументОснование,
	|Комментарий,
	|Контрагент,
	|Организация,
	|Ответственный,
	|Подразделение,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "ДополнительныеРасходы";
	СтрокаРеквизитов =
	"Договор,
	|Комментарий,
	|Контрагент,
	|Организация,
	|Ответственный,
	|Подразделение,
	|СтруктурнаяЕдиница,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "ЗаданиеНаРаботу";
	СтрокаРеквизитов =
	"Комментарий,
	|Организация,
	|Состояние,
	|Сотрудник,
	|СтруктурнаяЕдиница,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "ЗаказНаПроизводство";
	СтрокаРеквизитов =
	"ДокументОснование,
	|Комментарий,
	|Организация,
	|Ответственный,
	|СостояниеЗаказа,
	|СтруктурнаяЕдиница,
	|СтруктурнаяЕдиницаРезерв";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "ЗаказПокупателя";
	СтрокаРеквизитов =
	"Договор,
	|ДокументОснование,
	|КалькуляцияРассчитана,
	|Комментарий,
	|Контрагент,
	|Организация,
	|Ответственный,
	|СостояниеЗаказа,
	|СтруктурнаяЕдиницаПродажи,
	|СтруктурнаяЕдиницаРезерв,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "ЗаказПоставщику";
	СтрокаРеквизитов =
	"Договор,
	|Комментарий,
	|Контрагент,
	|Организация,
	|Ответственный,
	|СостояниеЗаказа,
	|СтруктурнаяЕдиница,
	|СтруктурнаяЕдиницаРезерв,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "РасходДСПлан";
	СтрокаРеквизитов =
	"БанковскийСчет,
	|Договор,
	|ДокументОснование,
	|Касса,
	|Комментарий,
	|Контрагент,
	|Организация,
	|СтатусУтвержденияПлатежа,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "ИнвентаризацияЗапасов";
	СтрокаРеквизитов =
	"Комментарий,
	|Организация,
	|СтруктурнаяЕдиница";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "ОприходованиеЗапасов";
	СтрокаРеквизитов =
	"ДокументОснование,
	|Комментарий,
	|Организация,
	|СтруктурнаяЕдиница,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "ОтчетКомиссионера";
	СтрокаРеквизитов =
	"Договор,
	|Комментарий,
	|Контрагент,
	|Организация,
	|Ответственный,
	|Подразделение,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "ОтчетКомитенту";
	СтрокаРеквизитов =
	"Договор,
	|Комментарий,
	|Контрагент,
	|Организация,
	|Ответственный,
	|Подразделение,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "ОтчетОПереработке";
	СтрокаРеквизитов =
	"Договор,
	|Комментарий,
	|Контрагент,
	|Организация,
	|Ответственный,
	|Подразделение,
	|СтруктурнаяЕдиница,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "ОтчетОРозничныхПродажах";
	СтрокаРеквизитов =
	"КассаККМ,
	|Комментарий,
	|Организация,
	|Ответственный,
	|Подразделение,
	|СтруктурнаяЕдиница,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "ОтчетПереработчика";
	СтрокаРеквизитов =
	"Договор,
	|ДокументОснование,
	|Комментарий,
	|Контрагент,
	|Организация,
	|Ответственный,
	|Подразделение,
	|СтруктурнаяЕдиница";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "ПеремещениеДСПлан";
	СтрокаРеквизитов =
	"БанковскийСчет,
	|Касса,
	|Комментарий,
	|Организация,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "ПеремещениеЗапасов";
	СтрокаРеквизитов =
	"ДокументОснование,
	|Комментарий,
	|Организация,
	|СтруктурнаяЕдиницаПолучатель,
	|СтруктурнаяЕдиница";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "ПересортицаЗапасов";
	СтрокаРеквизитов =
	"ДокументОснование,
	|Комментарий,
	|Организация,
	|СтруктурнаяЕдиница,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "ПлатежноеПоручение";
	СтрокаРеквизитов =
	"БанковскийСчет,
	|Договор,
	|ДокументОснование,
	|Комментарий,
	|Контрагент,
	|Организация,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "ПоступлениеВКассу";
	СтрокаРеквизитов =
	"ДокументОснование,
	|Касса,
	|Комментарий,
	|Контрагент,
	|Организация,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "ПоступлениеДСПлан";
	СтрокаРеквизитов =
	"БанковскийСчет,
	|Договор,
	|ДокументОснование,
	|Касса,
	|Комментарий,
	|Контрагент,
	|Организация,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "ПоступлениеНаСчет";
	СтрокаРеквизитов =
	"БанковскийСчет,
	|ДокументОснование,
	|Комментарий,
	|Контрагент,
	|Организация,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "ПриходнаяНакладная";
	СтрокаРеквизитов =
	"Договор,
	|ДокументОснование,
	|Комментарий,
	|Контрагент,
	|Организация,
	|Ответственный,
	|Подразделение,
	|СтруктурнаяЕдиница,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "ПриходныйОрдер";
	СтрокаРеквизитов =
	"ДокументОснование,
	|Комментарий,
	|Организация,
	|СтруктурнаяЕдиница";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "СборкаЗапасов";
	СтрокаРеквизитов =
	"ДокументОснование,
	|Комментарий,
	|Организация,
	|СтруктурнаяЕдиница";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "РаспределениеЗатрат";
	СтрокаРеквизитов =
	"Комментарий,
	|Организация,
	|СтруктурнаяЕдиница";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "РасходИзКассы";
	СтрокаРеквизитов =
	"ДокументОснование,
	|Касса,
	|Комментарий,
	|Контрагент,
	|Организация,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "РасходСоСчета";
	СтрокаРеквизитов =
	"БанковскийСчет,
	|ДокументОснование,
	|Комментарий,
	|Контрагент,
	|Организация,
	|Подразделение,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "РасходнаяНакладная";
	СтрокаРеквизитов =
	"Договор,
	|ДокументОснование,
	|Комментарий,
	|Контрагент,
	|Организация,
	|Ответственный,
	|Подразделение,
	|СтруктурнаяЕдиница,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "РасходныйОрдер";
	СтрокаРеквизитов =
	"ДокументОснование,
	|Комментарий,
	|Организация,
	|СтруктурнаяЕдиница";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "РезервированиеЗапасов";
	СтрокаРеквизитов =
	"Комментарий,
	|Организация";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "СверкаВзаиморасчетов";
	СтрокаРеквизитов =
	"Комментарий,
	|Контрагент,
	|Организация";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "СдельныйНаряд";
	СтрокаРеквизитов =
	"ДокументОснование,
	|Исполнитель,
	|Комментарий,
	|Организация,
	|СтруктурнаяЕдиница,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "Событие";
	СтрокаРеквизитов =
	"ДокументОснование,
	|Ответственный,
	|Состояние";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "СписаниеЗапасов";
	СтрокаРеквизитов =
	"ДокументОснование,
	|Комментарий,
	|Организация,
	|СтруктурнаяЕдиница";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "СчетНаОплату";
	СтрокаРеквизитов =
	"Договор,
	|ДокументОснование,
	|Комментарий,
	|Контрагент,
	|Организация,
	|Ответственный,
	|Подразделение,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "СчетНаОплатуПоставщика";
	СтрокаРеквизитов =
	"БанковскийСчет,
	|Договор,
	|ДокументОснование,
	|Касса,
	|Комментарий,
	|Контрагент,
	|Организация,
	|Ответственный,
	|Подразделение,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "СчетФактура";
	СтрокаРеквизитов =
	"Договор,
	|Комментарий,
	|Контрагент,
	|Организация,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	ДокументКлюч = "СчетФактураПолученный";
	СтрокаРеквизитов =
	"Договор,
	|ДокументОснование,
	|Комментарий,
	|Контрагент,
	|Организация,
	|СуммаДокумента";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	
	//АТ+
	ДокументКлюч = "АТ_Обращение";
	СтрокаРеквизитов =
	"Информация,
	|Описание,
	|СтатусОбращения,
	|ИсточникОбращения,
	|Контрагент,
	|Договор";
	СтруктураРеквизитов.Вставить(ДокументКлюч, СтрокаРеквизитов);
	//АТ-

	Возврат СтруктураРеквизитов;
	
КонецФункции

